In [1]:
# 結合の種類
"""
内部結合
  - key列に共通の値がない行は破棄される
外部結合
  - 共通の値がない場合は行は残る
  - 共通出ない列はNaNで埋められる
"""

'\n内部結合\n  - key列に共通の値がない行は破棄される\n外部結合\n  - 共通の値がない場合は行は残る\n  - 共通出ない列はNaNで埋められる\n'

In [9]:
# 内部結合の基本
"""
pandas.merge(df1, df2, on=keyとなるカラム, how=inner)
"""
import pandas as pd
import numpy as np

data1 = {"fruits": ["apple", "orange", "banana", "strawberry", "kiwifruit"],
        "year": [2001, 2002, 2001, 2008, 2006],
        "amount": [1, 4, 5, 6, 3]}

df1 = pd.DataFrame(data1)
df1

   amount      fruits  year
0       1       apple  2001
1       4      orange  2002
2       5      banana  2001
3       6  strawberry  2008
4       3   kiwifruit  2006

In [7]:
data2 = {"fruits": ["apple", "orange", "banana", "strawberry", "mango"],
        "year": [2001, 2002, 2001, 2008, 2007],
        "price": [150, 120, 100, 250, 3000]}

df2 = pd.DataFrame(data2)
df2

       fruits  price  year
0       apple    150  2001
1      orange    120  2002
2      banana    100  2001
3  strawberry    250  2008
4       mango   3000  2007

In [8]:
# 内部結合
df3 = pd.merge(df1, df2, on='fruits', how='inner')
df3

   amount      fruits  year_x  price  year_y
0       1       apple    2001    150    2001
1       4      orange    2002    120    2002
2       5      banana    2001    100    2001
3       6  strawberry    2008    250    2008

In [6]:
# 外部結合の基本
"""
pandas.merge(df1, df2, on='keyとなるカラム', how='outer')
"""
import numpy as np
import pandas as pd

data1 = {"fruits": ["apple", "orange", "banana", "strawberry", "kiwifruit"],
        "year": [2001, 2002, 2001, 2008, 2006],
        "amount": [1, 4, 5, 6, 3]}
df1 = pd.DataFrame(data1)
df1

   amount      fruits  year
0       1       apple  2001
1       4      orange  2002
2       5      banana  2001
3       6  strawberry  2008
4       3   kiwifruit  2006

In [10]:
data2 = {"fruits": ["apple", "orange", "banana", "strawberry", "mango"],
        "year": [2001, 2002, 2001, 2008, 2007],
        "price": [150, 120, 100, 250, 3000]}
df2 = pd.DataFrame(data2)
df2

       fruits  price  year
0       apple    150  2001
1      orange    120  2002
2      banana    100  2001
3  strawberry    250  2008
4       mango   3000  2007

In [11]:
df3 = pd.merge(df1, df2, on='fruits', how='outer')
df3

   amount      fruits  year_x   price  year_y
0     1.0       apple  2001.0   150.0  2001.0
1     4.0      orange  2002.0   120.0  2002.0
2     5.0      banana  2001.0   100.0  2001.0
3     6.0  strawberry  2008.0   250.0  2008.0
4     3.0   kiwifruit  2006.0     NaN     NaN
5     NaN       mango     NaN  3000.0  2007.0